export const faqList = [
  {
    question: '我要如何進入遊戲？',
    answer:
      '可透過登入親師生平台，從平台上進入遊戲網站，詳細登入方式可參考親師生平台操作手冊。',
  },
  {
    question: '我想要參加遊戲，但我沒有親師生平台帳號。',
    answer:
      '新北市健康識能推廣暨競賽內容與新北市親師生平台聯動，將優先開放予擁有親師生平台帳號之師生或家長，家長帳號申請方式可參考親師生平台操作手冊。',
  },
  {
    question: '個人戰與團體戰的差別在哪裡？',
    answer:
      '個人戰開放時間為112年3月1日至6月1日，具有新北市親師生平台之會員，不限年齡與性別皆可參與；團體戰開放時間為112年3月1日至4月28日，僅開放給就讀本市國小之在學學生組隊參與。',
  },
  {
    question: '個人戰要如何參加抽獎？',
    answer:
      '於活動時間集齊14片碎片（14類題型的3個關卡都挑戰成功），即可獲得抽獎資格。',
  },
  {
    question: '校園初賽要如何參加抽獎？',
    answer:
      '於初賽期間隊伍遊戲次數達24次，所有隊員（含候補隊員）及指導老師皆有抽獎資格喔！',
  },
  {
    question: '我要如何參加積點趣活動？',
    answer:
      '於個人戰開放時間，可透過登入遊戲、完成遊戲、蒐集碎片等方式累計親師生平台學習積點。',
  },
  {
    question: '校園初賽學生登入後，畫面顯示「沒有參加這場遊戲」要怎麼辦？',
    answer:
      '請先確認同一隊登入隊員是否已達三位，導致第四位隊員顯示此畫面；如確認後仍無法正常遊戲，可能上一場遊戲不正常結束（未看到最後積分畫面就關閉畫面），請指導老師登入後，至網路競賽→隊伍管理→查看答題記錄→強制結束該隊伍遊戲，之後再請學生重新進入遊戲即可。',
  },
  {
    question: '選項顯示不正常，出現「一個」、「乙」或「喔」。',
    answer:
      '請確認是否按到瀏覽器的自動翻譯功能，而導致部分英文被強制翻譯，請老師協助學生關閉自動翻譯功能；如仍有不正常顯示，請截圖並寄至活動小組聯絡信箱。',
  },
  {
    question: '想要更換遊戲玩家，但沒辦法登出或換帳號。',
    answer:
      '因系統與親師生平台串聯，無法單獨登出遊戲，如需切換帳號，請至親師生平台登出後再登入其他帳號，再透過親師生平台下方的連結進入遊戲網頁，即可使用其他帳號遊戲。或可使用無痕視窗(Ctrl+Shift+N)登入遊戲，欲登出或更換帳號時，直接關閉無痕視窗再重新開啟即可。',
  },
  {
    question: '要去哪裡看到答題記錄？',
    answer:
      '答題記錄查詢可於每場遊戲結束後進行查看。在校園初賽中，老師端可至網路競賽→隊伍管理→查看答題記錄，查看學校各隊的遊戲紀錄及答題狀況；學生端可至網路競賽→進入遊戲→團體戰→查看答題記錄，可查看所在隊伍之遊戲紀錄及答題狀況。（遊戲開始時第四位隊員將無法進入遊戲房間，亦無法看到答題記錄）。',
  },
];
