// TODO 沒接API 暫時的做法

type NewsItem = {
  _id: number;
  title: string;
  createAt: string;
  body?: string;
};

export const newsList: NewsItem[] = [
  {
    _id: 1,
    title: '【111學年度新北市健康識能競賽】🎉好禮大獎抽-得獎名單🎉',
    createAt: '2023-06-02',
    body: `<h3>【111學年度新北市健康識能競賽】🎉好禮大獎抽-得獎名單🎉</h3>
  <p>👏讓大家久等了，好禮大獎抽得獎名單出爐囉👏</p>
  <ul>
    <li>👤個人賽得獎名單看這邊👉<a href="https://supr.link/f9DJs" target="_blank" rel="noopener noreferrer">https://supr.link/f9DJs</a></li>
    <li>👥校園賽得獎名單看這邊👉<a href="https://supr.link/7TxHj" target="_blank" rel="noopener noreferrer">https://supr.link/7TxHj</a></li>
  </ul>
  <p>🎉我們一起恭喜各位得獎者！🎉</p>
  <br>
  <p>🎁為降低兌獎流程，今年兌獎模式將採線上化，兌獎流程如下：</p>
  <ol>
    <li>登入親師生平台</li>
    <li>進入「兌換獎品」分頁</li>
    <li>選擇「遊戲抽獎」</li>
    <li>依照畫面顯示填入相關資料</li>
    <li>用滑鼠（桌機）或觸控（手機、平板）簽名</li>
    <li>點擊送出後即完成兌獎資料填寫</li>
  </ol>
  <br>
  <p>👍👍👍<br>
  主辦單位將核對完資料後陸續將禮物寄至收件地點<br>
  以上說明，如有任何問題歡迎致電活動小組:02-8521-5016</p>
`,
  },
  {
    _id: 2,
    title: '【111學年度新北市健康識能競賽】校園競賽-決賽結果公告',
    createAt: '2023-05-29',
  },
  {
    _id: 3,
    title: '【111學年度新北市健康識能競賽】校園競賽-初賽結果公告',
    createAt: '2023-05-02',
    body: `<h3>【111學年度新北市健康識能競賽】校園競賽-初賽結果公告</h3>
    <p>【111學年度新北市健康識能競賽】校園競賽-初賽已於4月28日正式結束</p>
    <p>經積分統計，校園均分獎：</p>
    <br>
      <ol>
      <li>第一名：三鶯分區-文林國小 25389</li>
      <li>第二名：三鶯分區-鶯歌國小 25198</li>
      <li>第三名：三重分區-修德國小 24698</li>
      <li>第四名：三鶯分區-中園國小 24215</li>
    </ol>
    <br>
    <p>晉級決賽之隊伍如下：<br>
    <p>七星分區：金山國小-腹劍隊、金山國小-腹劍隊</p>
    <p>三重分區：修德國小-修養德性得第一、修德國小-修德藝才好棒棒</p>
    <p>三鶯分區：鶯歌國小-讚 無 名 稱、文林國小-小兵立大功</p>
    <p>文山分區：中正國小-608、新店國小-503棒！！！</p>
    <p>板橋分區：文德國小-文德J.H.M、文德國小-文德JYJJ</p>
    <p>淡水分區：育英國小-閃電五連鞭、育英國小-???</p>
    <p>新莊分區：五股國小-五股老鷹、五股國小-五股蒼龍</p>
    <p>瑞芳分區：平溪國小-功蓋天下、平溪國小-獨占鰲頭</p>
    <p>雙和分區：育才國小-紅和之智之峙鴻我好棒之畂陟旳稦嶹、育才國小-熊貓小隊</p>
    <p>不分區前：鶯歌國小-盛夏巴斯光年、鶯歌國小-2023星CLSG</p>
    <br>
    <p>恭喜上述入圍隊伍，感謝各校各隊的踴躍參賽</p>
    <p>詳細積分可至排行榜查詢</p>
    <br>
    <p>※活動小組後續將主動聯繫晉級隊伍，說明後續決賽事宜</p>
    <p>※個人賽遊戲持續到6月1日，仍可繼續體驗遊戲。</p>
    `,
  },
  {
    _id: 4,
    title: '【111學年度新北市健康識能競賽】校園競賽-初賽倒數一週',
    createAt: '2023-04-21',
    body: `
    <h3>【111學年度新北市健康識能競賽】校園競賽-初賽倒數一週</h3>
    <br>
    <p>感謝各校老師對於【111學年度新北市健康識能競賽】的支持</p>
    <p>校園競賽-初賽 倒數最後一週，積分將統計至4月28日 22時</p>
    <p>積分計算將取前40高分的遊戲分數為主</p>
    <p>敬請各校隊伍把握時間進行遊戲，為學校爭取最高的榮譽！</p>
    <br>
    <p>入選決賽隊伍，可自5月2日 12時起於最新消息查詢，亦可自行至排行榜查詢，另將訂於5月10日 上午10時 召開領隊會議，請各隊指導老師預留時間。</p>
    `,
  },
  {
    _id: 5,
    title: 'LINE POINTS開放兌獎',
    createAt: '2023-04-11',
    body: `
      <h3>LINE POINTS開放兌獎</h3>
      <br>
      <p>LINE POINTS已於積點趣開放兌獎，每人限換一份，數量有限，換完為止！</p>
      <p>LINE POINTS已於積點趣開放兌獎，每人限換一份，數量有限，換完為止！</p>
      <p>詳情請至親師生平台積點趣商城查詢</p>
     <a href="https://store.ntpc.edu.tw" target="_blank" rel="noopener noreferrer">https://store.ntpc.edu.tw</a>
    `,
  },
  {
    _id: 6,
    title: '※3/28 題目修正公告',
    createAt: '2023-03-28',
    body: `
    <h3>※3/28 題目修正公告</h3>
    <br>
    <p>原長期照顧第82題</p>
    <p>Q82.長照服務的服務對象僅限無法自理生活的失能者。</p>
    <p>答案有誤，故予以刪除</p>
  `,
  },
  {
    _id: 7,
    title: '※3/27 題目修正公告',
    createAt: '2023-03-27',
    body: `
    <h3>※3/27 題目修正公告</h3>
    <br>
    <p>原緊急救護第110題</p>
    <p>Q110.腦中風FAST口訣的T是指Time，發現疑症狀時，記下發作時間立刻送醫。</p>
    <p>答案有誤，故予以刪除</p>
  `,
  },
  {
    _id: 8,
    title: '※3/23 題目修正公告',
    createAt: '2023-03-23',
    body: `
    <h3>※3/23 題目修正公告</h3>
    <br>
    <p>原傳染病防治第72題</p>
    <p>Q72.結核病好發於45歲以上民眾。</p>
    <p>答案有誤，故予以刪除</p>
    <br>
    <p>原傳染病防治第114題</p>
    <p>Q114.下列何者不是流感病毒會引起的併發症？</p>
    <p>答案有誤，故予以刪除</p>
  `,
  },
  {
    _id: 9,
    title: '【111學年度新北市健康識能競賽】校園初賽遊戲次數補償說明',
    createAt: '2023-03-17',
    body: `
    <h3>【111學年度新北市健康識能競賽】校園初賽遊戲次數補償說明</h3>
    <br>
    <p>學校反映遊戲進行時，有知識核心消失，導致遊戲無法完成，經系統工程師緊急處理，已於112年3月17日上午6時更新版本。</p>
    <br>
    <p>針對系統問題影響參賽過程，爰調整規則如下：</p>
    <br>
    <p>1.每隊遊戲次數40次調整為55次。</p>
    <p>2.積分從55次中取40次高分紀錄，作為進入決賽之依據。</p>
  `,
  },
  {
    _id: 10,
    title: '※3/6題目修正公告',
    createAt: '2023-03-06',
    body: `
    <h3>※3/6題目修正公告</h3>
    <br>
    <p>原慢性病防治第175題</p>
    <p>Q175.低血糖不會出現哪一個症狀?</p>
    <p>答案有誤，故予以刪除</p>
  `,
  },
  {
    _id: 11,
    title: '※分頁測試',
    createAt: '2023-03-06',
  },
];
